In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('E:/database/info.csv')

In [3]:
df

      name   age   id
0  mohamed   NaN  5.0
1    ahmed  22.0  NaN
2      NaN  12.0  7.0
3     ziad  17.0  NaN

In [5]:
data = df.fillna("empty")

In [6]:
data

      name    age     id
0  mohamed  empty    5.0
1    ahmed   22.0  empty
2    empty   12.0    7.0
3     ziad   17.0  empty

In [7]:
data.to_csv('E:/dataframe/new_data.csv')

In [9]:
data

      name    age     id
0  mohamed  empty    5.0
1    ahmed   22.0  empty
2    empty   12.0    7.0
3     ziad   17.0  empty